Repository: eunhyekoo/glo_project
Catalog: feedback/TMData/[Naver] Meow Rangers.tmx
Source language: ko_kr
Languages: en_us

source: ...마...맙소사.
en_us: H-HOLY SMOKES...

source: ...멀쩡한 것 같은데!?
en_us: HE LOOKS FINE...!

source: 오...
en_us: H...

source: 촤 악
en_us: CLACK

source: 뭐...뭐냐!!
en_us: WH-WHAT THE...?!

source: 드르{j}륵
en_us: SLIDE{j}

source: 빛이...
en_us: IS PRACTICALLY GLEAMING...

source: 다들...!!
en_us: ...ALL OF YOU...!!

source: 그게 뭔데.
en_us: WHAT’S THAT?

source: 촵
en_us: CLACK

source: 뭐야...
en_us: WHAT THE...

source: 치와를 졸라서 네 시계도 혜민이란 아이와 같은 개조를 했어.
en_us: I PESTERED CHIWA TO RENOVATE YOUR WATCH, SO IT’S NOW ON PAR WITH HYEMIN’S WATCH.

source: 깜짝
en_us: FLINCH

source: 녀석의 기술이 아니야...!!
en_us: HIS NEW SKILL...!!

source: 가족들, 친구들은...
en_us: WHO’LL LOOK AFTER...

source: 사방으로 높은 벽이 쳐져서 더욱 어두워,,,!!
en_us: THE HIGH WALLS ALL AROUND ME ARE MAKING IT EVEN DARKER...!

source: 쿠{j}
en_us: WOOSH

source: 형처럼 될까 봐.
en_us: ...THAT YOU MIGHT TURN OUT LIKE ME.

source: 다...당신..!!
en_us: Y-YOU...!!

source: 지껄
en_us: BUSTLE

source: 어차피 죽을 거라면...
en_us: IF YOU’RE GONNA DIE ANYWAY...

source: 죽고 싶지 않아!!
en_us: I DON’T WANNA DIE!!

source: 구구구..
en_us: RUMBLE

source: 농담할 때가 아니야...
en_us: THIS IS NO TIME FOR JOKES.

source: 콰{j}직
en_us: PRESS CRUMBLE{j}

source: 그러고 보니...
en_us: ON SECOND THOUGHT...

source: 중얼
en_us: MUMBLE

source: 호열 아저씨도...
en_us: MR. HOYEOL...

source: 우리의 적은 같아.
en_us: WE HAVE THE SAME ENEMY.

source: 켁
en_us: COUGH

source: 너희는 이런 거 배우지 마라.
en_us: DON’T EVEN START WITH THIS STUFF.

source: 화 악
en_us: WHOOSH

source: 현민군-!!
en_us: HYEONMIN!!

source: 강한 힘이 있어봤자 마음이 냐약해선, 아무것도 이룰 수 없습니다...
en_us: EVEN IF YOU HAVE GREAT POWER, IF YOUR HEART IS WEAK, YOU’LL ACCOMPLISH NOTHING...

source: 녀석도 슬슬 승부를 보려고 할 거다.
en_us: HE’LL TRY TO END IT SOON TOO.

source: 하아~~~~
en_us: SIGH...

source: ...집사레인저 전원한테 알려야 하는 거 아니야?
en_us: SHOULDN’T WE TELL ALL THE MEOW RANGERS?

source: 툭
en_us: BOOP

source: 엄마한테 지켜달라고 하지 뭐.
en_us: I’D ASK HER TO LOOK AFTER ME.

source: 싸울 생각 없으니까 긴장 풀라구.
en_us: IF WE CAN TALK THIS THROUGH.

source: 번{j}쩍
en_us: FLASH{j}

source: 터벅
en_us: STEP

source: 녀석들의 꿍꿍이가 뭔진 모르겠지만 3일 후면 알 수 있겠군.
en_us: I DON’T KNOW WHAT THEY’RE UP TO, BUT WE’LL FIND OUT IN THREE DAYS.

source: 그녀는-.
en_us: SHE...

source: XXㅅㄲ!
en_us: BASTARD!

source: 어어-!!
en_us: HEY!!

source: 뭐야...!?{j}이 녀석...!?
en_us: HUH...? WHO IS THIS GUY...?!{j}

source: 어리석군.
en_us: HOW FOOLISH...

source: 꽈{j}악
en_us: SNATCH{j}

source: 제가 지금 수고를 덜어드릴까요?
en_us: ...SHALL I SAVE YOU THE EFFORT AND FINISH HIM NOW?

source: 가자.
en_us: LET’S DO THIS.

source: 드르
en_us: SLIDE

source: 둘 다 함선에서 내려주셔야겠습니다.
en_us: I’M GOING TO HAVE TO ASK YOU TO LEAVE THIS SHIP.

source: 나 역시 녀석들이 두렵고 증오스러워.
en_us: AS MUCH AS YOU DO.

source: 냐아아아앙!!!
en_us: MEOOOW!!!

source: ...예상하신 대로입니다.
en_us: IT’S AS YOU EXPECTED...

source: 그것으로 인한 유전병 때문에 버림까지 받았지...
en_us: I WAS EVEN ABANDONED BECAUSE OF MY GENETIC DISEASE...

source: 그럴 줄 알고 너희를 따라서 온 거였지만.
en_us: WELL, THAT’S WHY I FOLLOWED YOU HERE.

source: 이 녀석들, 지쳤군.
en_us: THESE PUNKS ARE TIRED.

source: 지각-!!
en_us: I’M LATE!!

source: 어...어째서 그런짓을...!?
en_us: WH-WHY WOULD YOU DO SUCH A THING...?!

source: ...다 ...끝났어.
en_us: IT’S... ALL OVER.

source: 빨라!!
en_us: SHE’S FAST!!

source: 알았어!!
en_us: OKAY!!

source: 그렇다해도...
en_us: EVEN SO...

source: 세호가 네로한테 쫓기고...
en_us: SEHO IS BEING CHASED...

source: 으{j}아{j}아
en_us: AAAGH{j}{j}

source: 안심하세요!
en_us: BUT DONT WORRY!

source: 도망칠 수 있을까...?!
en_us: BUT CAN I...?!

source: 아는 사이?
en_us: KNOW EACH OTHER?

source: 우리를 집사레인저로 만든 냥인들은..
en_us: THE CAT PEOPLE WHO TURNED US INTO MEOW RANGERS...

source: 함선 내부의 시설을 지구인들에게 맞춰 리모델링한 주거 공간입니다.
en_us: WE’VE RENOVATED THE INTERIOR OF OUR SHIP TO BETTER SUIT THE NEEDS OF EARTHLINGS.

source: 씨몽키들을 다스리기 위한 방법으로 애정과 사랑을 선택한겁니다.
en_us: THEY CHOSE LOVE AND AFFECTION AS A WAY TO RULE THE C-MONKEYS.

source: 코앞에서도 전혀 보이지 않는다.
en_us: YOU WON’T SEE ME EVEN IF I WAS RIGHT UNDER YOUR NOSE.

source: 어휴, ㅅㅂ.
en_us: GOOD LORD.

source: 근데, 저들은 누구...?
en_us: BY THE WAY, WHO ARE THEY...?

source: ...어쩐지...
en_us: I KNEW IT...

source: 멈 칫
en_us: FREEZE

source: 폭주라...
en_us: LOST CONTROL, YOU SAY...

source: 정밀 검사 완료.
en_us: DETAILED EXAMINATION COMPLETE.

source: 그동안 나쁜 짓만 하면서 살아왔어.
en_us: I’VE LIVED A LIFE OF MISDEEDS.

source: 옥상이 더 안전하다고 한 ㅅㄲ 누구야!
en_us: WHO’S THE BASTARD THAT SAID IT WAS SAFER ON THE ROOF?!

source: 구구...
en_us: RUMBLE

source: 함선에 오르시는 건 오랜만이지요?
en_us: IT’S BEEN A WHILE SINCE YOU’VE BEEN ABOARD A SHIP, RIGHT?

source: 우리는 지구에서 고통받는 냥인들을 구원하기 위해...
en_us: WE’RE HERE TO SAVE CAT PEOPLE WHO ARE SUFFERING ON EARTH--

source: 팀과 내 자신을 살리기 위해서라면 수단과 방법을 가리지 않는...
en_us: I’D DO ANYTHING TO PROTECT MYSELF AND MY TEAM...

source: 그렇다고 어중간한 길거리 출신 냥인을 데려올 수도 없는 문제...
en_us: THAT SAID, WE CAN’T JUST USE ANY CAT OFF THE STREET...

source: 어쩔 수 없구만.
en_us: I GUESS I HAVE NO CHOICE.

source: 시끄러워...!!
en_us: SHUT UP...!!

source: 많은 지구인들이 의.식.주 문제 해결에 있어서 어려움을 겪고 있다는 것을 알 게 되었습니다.
en_us: ...AFTER WHICH I DISCOVERED THAT THE CITIZENS OF EARTH HAVE BEEN STRUGGLING TO OBTAIN THE BASIC NECESSITIES OF FOOD, SHELTER AND CLOTHING.

source: 휘 익
en_us: WHIRL

source: 뭣이...?
en_us: WHAT...?

source: 무슨 안마 의자냐고!!
en_us: WHAT IS THIS, A MESSED UP MASSAGE CHAIR?!

source: 내 눈을 바라봐 넌 행복해지고
en_us: LOOK INTO MY EYES AND YOU’LL BE HAPPY

source: 살려주세요.
en_us: PLEASE SPARE ME.

source: 뭐여.
en_us: WHAT’S THIS?

source: 이대로는 그냥 조금 더 버틸 수 있을 뿐이야!
en_us: ...BUT AT THIS RATE, IT WON’T LAST MUCH LONGER!

source: 공격할 틈을 주지 않아!!
en_us: YOU’RE NOT GIVING HIM ANY ROOM TO COUNTERATTACK!!

source: 조금만 버티면 풀리겠어.
en_us: JUST A MOMENT LONGER AND I’LL BREAK FREE.

source: 굳이 이런 곳까지 올 필요는 없었을 텐데.
en_us: YOU DIDN’T HAVE TO COME TO A PLACE LIKE THIS.

source: 거대 괴물이 나타날 줄 누가 알았어?!
en_us: WHO COULD’VE KNOWN A GIANT MONSTER WOULD SHOW UP?!

source: 장치 불안정
en_us: SYSTEM UNSTABLE.

source: 어...어떻게 되는 건데 치와!?
en_us: WH-WHAT IS THIS THING, CHIWA?!

source: 내겐 선택권이 없는 건가...!
en_us: I GUESS I DON’T HAVE A CHOICE...!

source: 효자다.{j}효자.
en_us: WHAT A GOOD SON.{j}

source: 촤 르 륵
en_us: SWOOSH

source: 방금 전 이상한 방송은...
en_us: THAT WEIRD BROADCAST JUST NOW...

source: 지구와 인간은 원래 우리의 것.
en_us: THE EARTH AND HUMANS ORIGINALLY BELONG TO US.

source: 그래...그래야 내 친구들이지.
en_us: YES... I EXPECTED NO LESS FROM MY FRIENDS.

source: 콰{j}과과광
en_us: RUMBLE{j}

source: 뭐...!?
en_us: WHAT...?!

source: - 이상한 나라의 현민 -
en_us: - HYEONMIN IN WONDERLAND -

source: 지구 청소, 진행시켜.
en_us: COMMENCE EARTH CLEANSING.

source: 슈
en_us: PSHHHH

source: 아니, [디비]다.
en_us: I MEAN, I’M DB.

source: 그게 중요한 거라고...
en_us: THAT’S WHAT REALLY MATTERS...

source: 핏 슈{j}웅
en_us: PSSH{j}

source: 냐아아앙!!!
en_us: MEEEOOOW!!

source: 이ㅅㄲ 힘 빠졌네?
en_us: HE’S NOT AS STRONG AS BEFORE?

source: 콱
en_us: CLENCH

source: 어차피 우리는 계속 냥잼을 받는다.
en_us: WE’RE GETTING MORE MEOW GEMS ANYWAY.

source: 위험해...!
en_us: SHE’S IN DANGER...!

source: 다른 녀석의 고양이 귀랑은 조금 달라보여...
en_us: THEY LOOK A LITTLE DIFFERENT FROM OTHER CATS’ EARS...

source: 믿어라.
en_us: TRUST US.

source: 콰 아 아
en_us: WOOSH

source: 호오.
en_us: HOH.

source: 구구
en_us: RUMBLE

source: 그냥 맞고만 있는 게 좋을 걸-!!
en_us: I SUGGEST YOU ONLY TAKE PUNCHES!!

source: 꿀꺽
en_us: GULP

source: 뭔가 띄웠어!
en_us: THEY’RE BROADCASTING SOMETHING!

source: 뭐야...!?
en_us: WHAT IS IT...?!

source: 자아, 이 에너지를 모두 흡수하시면...
en_us: NOW, ONCE YOU ABSORB THE ENERGY OF THESE TWO...

source: 때문에 슈트와 냥잼을 결합하더라도,
en_us: THEREFORE, EVEN WHEN THE MEOW GEM IS FUSED WITH A CAT SUIT,

source: 이 목소리는...!!
en_us: THAT VOICE...!!

source: 생각이 바뀌면 우리를 찾아라.
en_us: COME FIND US IF YOU CHANGE YOUR MIND.

source: 슥
en_us: WHISH

source: 샤 랄 라
en_us: GLOW{j}{j}

source: 우주선이면...
en_us: IF THE SCHOOL’S IN THE SPACESHIP...

source: 저 녀석만 쓰러트리면 퇴근인가요?!
en_us: CAN WE CALL IT A DAY ONCE WE TAKE HIM DOWN?!

source: 도....
en_us: I-I GOTTA GET OUT OF HERE...!!

source: 저기.
en_us: THERE.

source: 누나!!
en_us: XENIA!!

source: 잘 모르겠어요.
en_us: I DON’T KNOW.

source: 놓친다...!!
en_us: HE’S BREAKING AWAY...!!

source: 짜잔.
en_us: TA DA.

source: 이길 수 없다는 걸 알면서도 남을 지키기 위해 싸워왔어...!
en_us: ...HAS BEEN FIGHTING TO PROTECT OTHERS EVEN WHEN THERE WAS NO CHANCE OF WINNING...!

source: ...오셨습니까.
en_us: GREETINGS.

source: 뜬금없이 그 때 추억이 생각나더라고.
en_us: AND THAT MEMORY CAME BACK TO ME OUT OF THE BLUE.

source: 죽을 뻔 했다.
en_us: I ALMOST DIED.

source: 능력을 얻은 실험체들은 전부 폭주...
en_us: EVERY TEST SUBJECT THAT GAINED THE ABILITY LOST CONTROL...

source: 역시 방법은...
en_us: JUST AS I THOUGHT, THE ONLY WAY...

source: 이건 분명 진짜...
en_us: THIS IS REAL...

source: 꽈{j}아{j}악
en_us: SQUEEZE{j}{j}

source: 오빠가...
en_us: HYEONMIN...

source: 치와...
en_us: CHIWA...

source: 나비
en_us: BUTTERFLY

source: 궁
en_us: SLAM

source: 냥!?
en_us: MEOW?!

source: 방어력은 높아지지만...!
en_us: MUSCLE COMPRESSION MODE INCREASES MY DEFENSE...

source: 세뇌파 때문인지, 많은 사람들이 순순히 냥인들을 받아들였다.
en_us: PERHAPS IT WAS THE BRAINWASHING WAVE, BUT MANY PEOPLE COMPLIED.

source: 저기 우주선.
en_us: IT’S AT THE SPACESHIP.

source: 멈추십시오!
en_us: DON’T DO IT!

source: 으...{j}응!?
en_us: WH-WHAT?!{j}

source: 파 지직
en_us: PZZT

source: 가라,
en_us: GET LOST,

source: 내 집사는 인류청소의 날이 와도
en_us: WHEN THE DAY OF HUMAN CLEANSING COMES...

source: 쿠{j}당탕
en_us: TUMBLE{j}

source: 지금 이 순간에도...
en_us: AT THIS MOMENT IN TIME...

source: 캣슈트의 일부가 파괴되었습니다.
en_us: CAT SUIT PARTIALLY DESTROYED.

source: 나도.
en_us: ME TOO.

source: 아니~ 학교만 바꿀 건가 봐.
en_us: NO, JUST CHANGING SCHOOLS.

source: 그러니까 있을 때 잘하지 그랬어~!
en_us: GEEZ, YOU SHOULD’VE BEEN NICER TO HER!

source: 큭큭...
en_us: HEHE

source: 내...{j}내 오빠지만 미친ㅅㄲ 아니야 저거!?
en_us: I-I KNOW HE’S MY BROTHER BUT WHAT THE HELL IS WRONG WITH HIM?{j}

source: 끼이익
en_us: SCREECH

source: 나를 속인 거야!?
en_us: LIE TO ME?!

source: 그렇게 되면 그들에게 도움을 청할 수 없습니다.
en_us: IF THAT HAPPENS, WE’LL NEVER GET THEM TO HELP US.

source: 눈 똑바로 안 뜨고 다녀?
en_us: WATCH WHERE YOU’RE GOING!

source: 꼬옥
en_us: CLUTCH

source: 그 능력에 대해 밝혀진 게 있나?
en_us: ...THE CAT PERSON’S PSYCHOKINETIC ABILITIES?

source: 진정해!!
en_us: CALM DOWN!!

source: 어...어딜 왕자님께!!
en_us: D-DO NOT APPROACH THE PRINCE!!

source: 아씨!!
en_us: SHIT!!

source: 우다닷
en_us: DASH

source: 디...디비님!
en_us: M-MASTER DB!

source: 띠링 회복 불능.
en_us: DING DING UNABLE TO RECOVER.

source: 혜민이 말귀 못 알아먹네...?
en_us: YOU DON’T GET IT, DO YOU...?

source: 제길!!!
en_us: DAMN!!!

source: 엄청난 미인...!
en_us: SHE’S BEAUTIFUL...!

source: 레이더에 걸릴 일도 없을 거야.
en_us: THE RADAR WON’T DETECT ME THEN.

source: 나간다고.
en_us: I SAID I’M GOING OUT.

source: 존재의 이유를 상실했군.
en_us: ...HAS LOST HER PURPOSE.

source: 총...!
en_us: GUNS IT IS...!

source: 으으읏..!!
en_us: UGH...!!

source: 네녀석을 찾고 있었다...!!
en_us: I’VE BEEN LOOKING FOR YOU...!!

source: 별의 별 녀석들을 다 봤지만 그중 제일 한심한 건...
en_us: I’VE SEEN ALL KINDS OF RANGERS, BUT THE MOST PATHETIC OF THEM ALL...

source: 오빠가 남은 사람들을 지켜야 한다고...!
en_us: ...HYEONMIN NEEDS TO LOOK AFTER THE OTHERS...!

source: 네...{j}네로...!
en_us: N-NERO...!!{j}

source: 냥인에게 도움을 받고 계약을 맺은 집사...
en_us: OTHERS WERE HELPED BY CAT PEOPLE AND FORMED CONTRACTS WITH THEM...

source: 하하.
en_us: HAHA.

source: 뭐...{j}뭔데...!
en_us: WH-WHAT..?!{j}

source: 빛을 비추는 쪽으로 위치해-!
en_us: STEP INTO THE LIGHT!

source: 촥
en_us: CLACK

source: 어!
en_us: OH!

source: 멋있었냐?
en_us: WAS IT COOL?

source: 호...
en_us: I...

source: 아니, 그게 아니라...
en_us: NO, I MEAN...

source: 디비...
en_us: DB...

source: 글썽
en_us: TEARY

source: 텁
en_us: TAP

source: 게다가...
en_us: ON TOP OF THAT...

source: 칫, 이깟 안개...!!
en_us: TSK, THIS SMOKE...!!

source: 아니라...
en_us: I MEAN...

source: 그리고 내 임무가 비교적 평화적인 방법이지.
en_us: ...AND MINE IS MORE PEACEFUL THAN HERS.

source: 훌륭한 집사네요.
en_us: YOU’VE GOT A TOUGH BUTLER, I SEE.

source: - 패잔병 -
en_us: - SURVIVORS -

source: 웃기지마!!
en_us: CUT THE CRAP!

source: "매가 약이다."
en_us: “THE STICK CURES ALL.”

source: 녀석의 공격을 읽을 수 있다...!
en_us: ...THEN I CAN GAUGE HER ATTACK...!

source: 왜 너를 집사레인저로 만들어 달라 했을까.
en_us: THE REASON I ASKED HIM TO MAKE YOU A RANGER.

source: 아무 일도 없을 거다.
en_us: ...THERE WON’T BE A PROBLEM.

source: 이것밖에 안 되는 존재였나...!
en_us: ...IS REDUCED TO THIS...!

source: 환자분!!
en_us: WAKE UP!!

source: 슈트가 응급처치 중인데...!!
en_us: HER SUIT IS APPLYING EMERGENCY TREATMENT RIGHT NOW...!!

source: 이 바보 자식...
en_us: THAT FOOL...

source: 대신...
en_us: IN RETURN...

source: 찍찍...!! (알 수 없는 힘이 용솟음 친다...)
en_us: TWEEK TWEEK...!! (I FEEL INDESCRIBABLE POWER FLOWING THROUGH ME...)

source: 너희 집사레인저와 인간들은
en_us: THE FIRST THING SHE’LL DO...

source: 자신의 생각따윈 없는 한심한 인간.
en_us: THEY’RE PATHETIC HUMANS THAT CAN’T THINK FOR THEMSELVES.

source: 슈우{j}욱
en_us: WHOOSH{j}

source: 조작법도 너희가 맨날 하던 '우당탕 로봇 격투 게임' 이랑 똑같아!
en_us: AND IT OPERATES JUST LIKE THE RUMBLE ROBOT COMBAT GAME YOU USED TO PLAY EVERYDAY.

source: 저 작은 생명체가 어디까지 힘을 낼수 있을지 궁금하군.
en_us: I WONDER HOW MUCH POWER A TINY LITTLE CREATURE LIKE THAT CAN MUSTER.

source: 우주선...!?
en_us: THE SPACESHIP...?!

source: 들리냐?!
en_us: CAN YOU HEAR ME?!

source: 그런 사람이 내 주변에 있나...?
en_us: ...I CAN TRUST THIS PERSON TO HELP ME?

source: 그동안 녀석이 덮치면 끝이야!!
en_us: IF HE ATTACKS NOW, IT’S ALL OVER!!

source: 쿠{j}구구구
en_us: CRUSH RUMBLE{j}

source: 혜민양, 현민군!
en_us: HYEMIN, HYEONMIN!

source: 방금 졌다고 한 건 취소!
en_us: I TAKE BACK SAYING I LOST!

source: 으앗!
en_us: AGH!!

source: 하나도 안 아파!
en_us: I BARELY FELT A THING!

source: 어디 다치진 않았습니까.{j}레이디?
en_us: ARE YOU HURT ANYWHERE, MY LADY?{j}

source: 자아, 염동력으로 먹이를 꺼내보라고.
en_us: NOW, USE PSYCHOKENESIS TO RETRIEVE THE FOOD.

source: 터벅..
en_us: TRUDGE

source: 모두를...!
en_us: ALL OF THEM...!

source: 끄아악!!
en_us: AAGH!!

source: 콰 아 아..
en_us: PSHAAA

source: 우주선 녀석들은 지구 출신이라면 인간, 냥인 가리지 않고 죽일 거다.
en_us: THE PUNKS ON THAT SPACESHIP WILL INDISCRIMINATELY KILL EVERYONE FROM EARTH, BOTH HUMANS AND CAT PEOPLE ALIKE.

source: 미...
en_us: S-SORRY...

source: 애옹
en_us: NYAAA

source: 팍씨
en_us: WHY I OUGHTA

source: 말해!!
en_us: ANSWER ME!

source: 내가 집사레인저가 된 이야기...
en_us: I’LL TELL YOU...

source: 아직 얘기 안 끝났어.
en_us: WE HAVEN’T FINISHED TALKING.

source: 더 늦기 전에 지구를 정화해야 한다구.
en_us: WE MUST PURIFY THE EARTH WITHOUT DELAY.

source: 슈우욱...
en_us: CRUMBLE

source: 나대기만 해봐라.
en_us: ...SO WATCH YOUR STEP.

source: ...겁먹었나.
en_us: ARE YOU SCARED?

source: 더 연구할 것도 없어.
en_us: WE DON’T NEED ANY MORE RESEARCH.

source: 엄마...
en_us: MOM...

source: 인간 따위...
en_us: ...WHY HUMANS...

source: 아아.
en_us: AH.

source: [인간]은 인공진으이 무력화 되고 나서 침입한다.
en_us: HUMANS FOLLOW ONCE THE A.I. IS DEACTIVATED.

source: 생각도 못 했군.
en_us: I NEVER THOUGHT OF THAT.

source: 저기 누워있는 네로의 친구들...!!
en_us: ALL OF NERO’S FRIENDS ON THE GROUND OUT THERE...!!

source: 어어어!?
en_us: WHAAAT?!

source: 잠깐 얘기 좀 하지.
en_us: LET’S CHAT.

source: 다치게 하고 싶지 않은 걸...
en_us: ...DONGSIK TO GET HURT...

source: 충전 완료
en_us: RECHARGE COMPLETE.

source: ...그래.
en_us: ALL RIGHT....

source: 꿈틀
en_us: TWITCH

source: 덜덜덜
en_us: QUIVER QUIVER

source: 으라이얏!!
en_us: HIYAAA!!

source: 민식군?!
en_us: ARE YOU OKAY?!

source: 빼앗기더라도 전부 죽여버리겠다는 뜻!!
en_us: IT CAN ONLY MEAN SHE INTENDS TO SLAUGHTER US ALL!!

source: 자...잠깐!
en_us: W-WAIT!

source: 딸칵
en_us: CLACK

source: 어쩌다 집사레인저가 이렇게 되어버린 거냐.
en_us: HOW DID THE MEOW RANGERS END UP LIKE THIS?

source: 쿠 구 구
en_us: WHISH

source: 알아냈습니다.
en_us: THE SECRET OF THIS ABILITY.

source: 누군가 내가 맞고 온 거에 분해해줬다는 거.
en_us: SOMEONE WAS ANGRY THAT I GOT BEAT UP...

source: 아무리 캣슈트를 입었다고 해도 그렇게 움직이면 다쳐요!!
en_us: I DON’T CARE IF YOU’VE GOT A CATSUIT, YOU’LL GET HURT IF YOU MOVE LIKE THAT!!

source: 아, 깜돌씨.
en_us: OH, SHADOW.

source: 아니, 모집 하고 있을 거다.
en_us: NO, RECRUITING HUMANS...

source: 이 안개 때문에!!
en_us: ...BECAUSE OF THE SMOKE!

source: 딱 보면 몰라!!
en_us: ISN’T IT OBVIOUS?!

source: 냥인의 [희망]을 포기하신 겁니다.
en_us: ...AND THE HOPE OF ALL CAT PEOPLE.

source: 깜돌은 예전에 집사레인저였어.
en_us: SHADOW WAS A MEOW RANGER A LONG TIME AGO.

source: ...다 모였군.
en_us: LOOKS LIKE WE’RE ALL HERE.

source: 사...사랑합 ...
en_us: I-I LOVE YOU--

source: 우리를 상대할 수 있을 것 같아?
en_us: WITHOUT YOUR CAT SUIT?

source: 어이, 수갑풀어줘.
en_us: HEY, UNCUFF HIM.

source: 우왓-!
en_us: WHOA!

source: 그리고 어둠은 어디에나 항상 존재한다.
en_us: AND DARKNESS IS ALWAYS PRESENT, EVERYWHERE.

source: 지켜야 될 소중한 사람들...!{j}아직 많잖아!
en_us: THERE ARE STILL SO MANY PEOPLE WE LOVE AND CHERISH... THAT WE HAVE TO PROTECT!

source: 잠깐!
en_us: WAIT!

source: 뭔가 착각하고 있군요.
en_us: I’M AFRAID YOU’RE MISTAKEN.

source: 리더라는 녀석은 이 모양이고...
en_us: THEIR LEADER IS SIDELINED...

source: 당장 사이캣을 풀지 못 할까!!
en_us: LET PSYCAT GO THIS INSTANT!!

source: 치..{j}치와!!!
en_us: CH-CHIWA!!!{j}

source: 불가능에 가까...
en_us: THAT WILL BE NEARLY IMPOSSIBLE...

source: 리모델링 완료
en_us: PHYSICAL NEEDS OF EARTHLINGS

source: 촤 르륵
en_us: CLICK CLICK

source: 당신들이 벌인 일, 당신들이 책임 지라고!!
en_us: YOU LOT STARTED THIS MESS, SO YOU TAKE RESPONSIBILITY FOR IT!!

source: 녀석들의 도움이 필요하지 않습니까.
en_us: DON’T WE NEED THEIR HELP?

source: 다양한 편의시설
en_us: VARIOUS AMENITIES

source: 퍼{j}억
en_us: THWACK{j}

source: 아니.
en_us: NOPE.

source: 냥잼이...
en_us: THERE ARE...

source: 허접한 정의감에 사로잡힌 집사.
en_us: OTHERS WERE TRAPPED BY THEIR OWN MISGUIDED SENSE OF JUSTICE.

source: 그렇지만도 않았다.
en_us: ...BUT THAT WAS NOT THE CASE.

source: 뭐...뭐야!!
en_us: WH-WHAT’S HAPPENING?!

source: 딱 대!!
en_us: DON’T MOVE!!

source: 찍어야지!
en_us: I GOTTA FILM THIS!

source: 누구 가족아니야?
en_us: ISN’T SHE SOMEONE’S FAMILY MEMBER?

source: 펄럭
en_us: FLUTTER

source: 네로로 부터 집사레인저를, 냥잼을, 롱캣을 지키는 유일한 방법이야.
en_us: ...IS YOUR ONLY WAY OF PROTECTING THE MEOW RANGERS, THE MEOW GEM, AND LONG CAT FROM NERO.

source: 더 옳을까...?
en_us: YOUR CAUSE IS MORE RIGHTEOUS THAN MINE?

source: 동식 오빠를...
en_us: ...I DON’T WANT...

source: 동료를 믿으라고...
en_us: TRUST YOUR COMRADE...

source: 금방 돌아올테니까 딱 기다려-!!!
en_us: I’LL BE RIGHT BACK, SO STAY RIGHT THERE!!!

source: 그럼 쉬고 계세요.
en_us: WELL, REST UP.

source: 다 죽는다고!!!
en_us: WE’RE ALL GONNA DIE!!!

source: 주의를 분산시키다가 치명타를 날리는 게 공략법.
en_us: I’M GONNA DISTRACT HER AND LAND A CRITICAL PUNCH.

source: @!&#@*유전자가 다르다는 것을...
en_us: AND DISCOVERED THAT THE @!&#@* GENE IS DIFFERENT BETWEEN THEM...

source: 핵주먹 펀치-!!
en_us: NUCLEAR FIST PUNCH!!

source: 더 이상 냥인들이 인간들의 기억을 지울 필요가 없어졌 거든.
en_us: CAT PEOPLE NO LONGER NEED TO ERASE HUMANS’ MEMORIES.

source: 뚫린 입이라고..!!
en_us: WATCH YOUR MOUTH...!!

source: 제...젠장.
en_us: UGH... DAMN.

source: 기다리고 있었습니다.
en_us: I’VE BEEN WAITING FOR YOU.

source: 늦었어!!
en_us: TOO LATE!!

source: 나한테도 쩔쩔매면서 부르긴 뭘 부르라는 거야!
en_us: STOP TALKING NONSENSE WHEN YOU CAN’T EVEN STAND UP TO ME!

source: 미...{j}미안.
en_us: S-SORRY.{j}

source: 뭐하다 이제 오는 거냐...!
en_us: WHAT TOOK YOU SO LONG...?!

source: 중요한 일은 준비가 안 됐을 때 찾아오지.
en_us: SERIOUS THINGS HAPPEN WHEN YOU’RE NOT READY.

source: 사이캣을 풀어-!!
en_us: LET PSYCAT GO!!

source: 괜찮을리가 없잖아요...!
en_us: OF COURSE NOT...!

source: 몸 좀 어때?
en_us: HOW ARE YOU FEELING?

source: 위{j}잉
en_us: PRRR{j}

source: 이게 다 뭐냐고!!
en_us: IS ALL THIS?!

source: 비열한 인간 녀석들...!!
en_us: VILE HUMANS...!!

source: 호열 아저씨가...!!
en_us: MR. HOYEOL...!!

source: 세...세상에!!
en_us: M-MY GOD!!

source: 으아아
en_us: AAAH

source: 그저...
en_us: SHE WAS JUST...

source: 부 우
en_us: WHOOSH

source: 엄마, 아빠가 가라고 난리인데...
en_us: MY PARENTS ARE RAISING HELL FOR ME TO GO THERE...

source: 감히 고양이 따위가...!
en_us: HOW DARE THOSE MEASLY CATS...!

source: 쩌 적
en_us: CRACKLE

source: ...약속 지키시킬.
en_us: YOU BETTER KEEP YOUR WORD...

source: 흥, 발목이나 잡지마라.
en_us: HMPH, JUST DON’T HOLD ME BACK.

source: 단언컨데, 누구든지 어렵지 않게 입주 가능합니다.
en_us: YOU HAVE MY WORD, ANYONE CAN MOVE IN HERE WITH EASE.

source: 스 으 윽
en_us: WHOOSH

source: 저들이 없었다면 함선 소환이 더 늦었을 겁니다.
en_us: IF NOT FOR THEM, IT WOULD’VE TAKEN LONGER TO RETRIEVE THE BATTLE SHIP.

source: 뭐야...?
en_us: WHAT THE...?

source: 그럴 수 밖에요.
en_us: IT HAD TO.

source: [목표물 조준-]
en_us: [ACQUIRING TARGET]

source: 네 놈...
en_us: YOU BASTARD...

source: 슈트 벗으면 팔굽혀 펴기 몇 개 하지도 못 하면서,
en_us: WITHOUT THE SUIT YOU CAN’T EVEN DO A FEW PUSH-UPS,

source: 네...네로...
en_us: N-NERO...

source: 꽈 악
en_us: SQUEEZE

source: ...재활.
en_us: REHAB...

source: 직
en_us: MBLE

source: 마치...
en_us: IT’S LIKE...

source: 인간 따위가 어디 냥인 눈을 똑바로 쳐다 봐!!
en_us: WHO DO YOU THINK YOU ARE LOOKING ME IN THE EYE?!

source: 도둑 고양이 녀석.
en_us: HEY, CAT THIEF.

source: 시시한 방법을 몇번이나 우려먹는 거냐!!
en_us: HOW MANY LOUSY TRICKS ARE YOU TRYING TO PULL?!

source: 우리...
en_us: WHAT HAPPENED...

source: 그 말라깽이가 또?!
en_us: THAT SKINNY TWERP HIT YOU AGAIN?!

source: 약점이 너무 많습니다.
en_us: ...BUT YOU HAVE TOO MANY WEAKNESSES.

source: 저번엔 당했었지만...
en_us: YOU GOT ME LAST TIME...

source: 안 되겠다 싶으면 도망쳐!!
en_us: IF THINGS GET OUT OF HAND, RUN!!

source: 나 역시 불로불사니, 염동력이니,
en_us: FROM THE BEGINNING, I NEVER WANTED THINGS LIKE...

source: 너야말로...!!
en_us: SPEAK FOR YOURSELF...!

source: 가...
en_us: HOW...

source: 자네들과 내가 함께 공격을 하는 걸세!!
en_us: YOU TWO AND I MUST ATTACK NOW TOGETHER!!

source: 비겁하지만...
en_us: IT’S COWARDLY, BUT...

source: 과연...!?
en_us: WILL IT DO IT...?!

source: 아냐, 죽을 지도 모른다고 바보야!
en_us: NO, YOU COULD ACTUALLY DIE, YOU FOOL!

source: 우리들의 이야기를.
en_us: ...OUR STORY.

source: 끄응...
en_us: HMMM

source: 네...네로님!
en_us: M-MASTER NERO!

source: 누가 죽는 다면 그건 너겠지만...
en_us: IF ANYONE’S DYING, IT’S YOU...

source: 감히 제가~ ♪
en_us: HOW DARE I~ ♪

source: 호열 아저씨뿐만 아니라...
en_us: NOT JUST MR. HOYEOL...

source: 잠깐..!!
en_us: ONE SEC...!

source: 같은 팀이 된 이상, 해치지 않으니.
en_us: AS LONG AS WE’RE A TEAM, I WON’T HARM HUMANS.

source: 난 함선에서 내려온지 얼마 안 됐거든.
en_us: I HAVEN’T BEEN OFF THE SHIP FOR VERY LONG...

source: 서로 잡아당겨서 더 빠르고 정확하게!
en_us: PULLING TOGETHER IS QUICKER AND MORE PRECISE!

source: I'm fine 'ㅅ'
en_us: I’M FINE :)

source: 3일 뒤, 하선으로 오를 수 있는 게이트를 오픈합니다.
en_us: IN THREE DAYS, THE BOARDING GATE TO THE SHIP WILL OPEN.

source: 뭐...뭐야...?
en_us: WH-WHAT THE...?

source: 주륵
en_us: DRIP

source: 뭘 망설이나.
en_us: WHY ARE YOU HESITATING?

source: 핏 슈
en_us: BZZ

source: 핏슝
en_us: SPLAT

source: 내 쪽으로 오는 거야!!
en_us: SHE’S COMING AFTER ME!!

source: 쿠구구
en_us: POW POW WHACK

source: 온다-!!!
en_us: HE’S COMING!!!

source: 오히려 냥인에 가깝다.
en_us: HE’S ACTUALLY CLOSER TO A CAT PERSON NOW.

source: 으갸갸갹!!
en_us: BRBRBRR!!

source: 우리의 패배는 얼마 지나지 않아 큰 나비효과를 불러오는데...
en_us: SHORTLY AFTER, OUR DEFEAT PRODUCED A MASSIVE BUTTERFLY EFFECT...

source: 상처...
en_us: ARE YOU...

source: 이 녀석들이 끈질기게 따라붙을 게 뻔하잖아.
en_us: IT’S OBVIOUS THESE ANNOYING PUNKS AREN’T GOING TO GIVE UP.

source: 왜 안 와...?
en_us: WHY ISN’T HE COMING...?

source: 녀석의 말이 신경쓰여...!!
en_us: I CAN’T STOP THINKING ABOUT WHAT SHE SAID...!!

source: 다시는 우리들 눈앞에 못 나타나게 해주마!
en_us: I’M GONNA MAKE SURE THAT NEVER HAPPENS AGAIN!

source: 때린 만큼만 맞아라?
en_us: BUT CAN YOU TAKE WHAT YOU DISHED OUT...?

source: 방해 될 녀석이라면 빼라.
en_us: KEEP OUT ANYONE THAT WOULD GET IN OUR WAY.

source: 벅 벅
en_us: SCRATCH SCRATCH

source: 위험하다는 걸 알면서도...
en_us: I KNOW IT COULD BE DANGEROUS...

source: 그동안 신세 많이 졌네...
en_us: I’M GRATEFUL FOR EVERYTHING YOU’VE DONE...

source: 일진에도 분명 선한 일진이 있고 악한 일진이 있고
en_us: THERE ARE GOOD BULLIES AND BAD BULLIES...

source: 도....{j}도망쳐야 해...!!
en_us: I-I GOTTA GET OUT OF HERE...!!{j}

source: 모습은 [풍선 근육 모드] 이지만
en_us: I MIGHT LOOK LIKE I’M IN INFLATED MUSCLE MODE...

source: 너는 아직도 망할 집사레인저 놀이 중이냐.
en_us: YOU’RE STILL PLAYING SILLY MEOW RANGER GAMES?

source: 다{j}다{j}다{j}닷
en_us: TAP TAP TAP{j}{j}{j}

source: 네가 알고 있는 인간과는 다르게 자비가 넘치는 녀석이지.
en_us: ...IS MORE COMPASSIONATE THAN ANY HUMAN YOU KNOW.

source: 힘이 빠지는게 느껴진다고.
en_us: I CAN FEEL YOU GETTING WEAKER.

source: 옛날 그대로군...
en_us: JUST LIKE HE’S ALWAYS BEEN...

source: 쿠 당
en_us: BURST

source: 이야기를 나눠볼까.
en_us: SHALL WE DISCUSS?

source: 말라깽이가 돼서 그런거냐?
en_us: IS IT BECAUSE YOU’VE SLIMMED DOWN?

source: 또 속임수를...!!
en_us: ANOTHER TRICK...!!

source: 내 능력을 보여주기 딱 좋은 상황이군.
en_us: NOW’S THE PERFECT MOMENT TO SHOW YOU MY POWER.

source: 무슨 음모를 꾸미고 있는 걸까.
en_us: THEY MUST BE UP TO SOMETHING.

source: 작전은 저희 함선쪽에서 마무리 하겠습니다.
en_us: WE IN THE SHIP WILL FINISH THE JOB FROM HERE.

source: 흠...
en_us: HMM...

source: 부하를 우선순위 밖에 둘 것을 강요한다면...
en_us: IF I’M BEING FORCED TO NEGLECT MY SUBORDINATES...

source: 저희는 그것을 바라고 있습니다.
en_us: THAT IS WHAT WE ASK.

source: 냥인이 세상을 지배했는데 학교 안 간 게 중요해?
en_us: CAT PEOPLE HAVE TAKEN OVER THE WORLD AND YOU’RE WORRIED ABOUT ME NOT GOING TO SCHOOL?

source: 현민아...!!
en_us: HYEONMIN...!!

source: 네가 어찌 할 수 있는 건 아니라고-!!
en_us: ...THERE’S NOTHING YOU CAN DO ABOUT IT!

source: 쒸익..
en_us: HUFF
